list_1 = [0, 1, 7, 2, 4, 8]

result = 0     #значення результату за замовчуванням

if list_1[-1] != 0:    #Проводимо перевірку на останній елемент списку, якщо 0 - беремо значення результату за замовчуванням
    sum = 0            #Значення суми за замовчуванням
    for i in range(0, len(list_1), 2):
        sum += list_1[i]    #шукаємо суму всі[ елементів списку з парним індексом
    result = sum * list_1[-1]    #шукаємо добуток суми чисел з парним індексом та останнього числа списку

#Виводимо результат обчислення
print(result)
